js216/stm32mp135_test_board/baremetal/qspi/src/cli.c
static HAL_StatusTypeDef crc32_mdma_start(const volatile uint8_t *p,
                                          uint32_t n)
{
   if (p == NULL || n == 0U)
      return HAL_ERROR;
   if (crc32_mdma_active)
      return HAL_BUSY;
   if (n > 65536U && (n & 0xFFFFU))
      return HAL_ERROR;

   __HAL_RCC_MDMA_CLK_ENABLE();

   MDMA_Channel_TypeDef *const ch = MDMA_Channel1;
   ch->CCR = 0U;
   crc32_mdma_clear_flags(ch);

   uint32_t trgm;
   if (n <= 128U)
      trgm = 0U; /* one buffer transfer */
   else if (n <= 65536U)
      trgm = 1U; /* one block transfer */
   else
      trgm = 2U; /* repeated 64 KiB blocks */

   ch->CTCR =
      (2U << MDMA_CTCR_SINC_Pos) |
      (0U << MDMA_CTCR_DINC_Pos) |
      (0U << MDMA_CTCR_SSIZE_Pos) |
      (0U << MDMA_CTCR_DSIZE_Pos) |
      (0U << MDMA_CTCR_SINCOS_Pos) |
      (0U << MDMA_CTCR_DINCOS_Pos) |
      (0U << MDMA_CTCR_SBURST_Pos) |
      (0U << MDMA_CTCR_DBURST_Pos) |
      ((128U - 1U) << MDMA_CTCR_TLEN_Pos) |
      (trgm << MDMA_CTCR_TRGM_Pos) |
      MDMA_CTCR_SWRM;

   if (n > 65536U) {
      const uint32_t blocks = n >> 16;
      ch->CBNDTR = (65536U & MDMA_CBNDTR_BNDT_Msk) |
                   MDMA_CBNDTR_BRSUM |
                   ((blocks - 1U) << MDMA_CBNDTR_BRC_Pos);
   } else {
      ch->CBNDTR = n & MDMA_CBNDTR_BNDT_Msk;
   }
   ch->CBRUR = 0U;
   ch->CSAR = (uint32_t)p;
   ch->CDAR = (uint32_t)&CRC1->DR;
   ch->CTBR = 0U;
   ch->CMAR = 0U;
   ch->CMDR = 0U;

   __asm volatile("dsb sy" ::: "memory");
   ch->CCR = MDMA_CCR_EN;
   __asm volatile("dsb sy" ::: "memory");
   ch->CCR = MDMA_CCR_EN | MDMA_CCR_SWRQ;
   crc32_mdma_active = true;
   return HAL_OK;
}

static HAL_StatusTypeDef crc32_mdma_wait(uint32_t timeout_ms)
{
   if (!crc32_mdma_active)
      return HAL_OK;

   MDMA_Channel_TypeDef *const ch = MDMA_Channel1;
   const uint32_t deadline = HAL_GetTick() + timeout_ms;

   for (;;) {
      const uint32_t cisr = ch->CISR;
      if (cisr & MDMA_CISR_TEIF) {
         my_printf("CRCMDMA TE cesr=%08lx\r\n",
                   (unsigned long)ch->CESR);
         ch->CCR = 0U;
         crc32_mdma_clear_flags(ch);
         crc32_mdma_active = false;
         return HAL_ERROR;
      }
      if (cisr & MDMA_CISR_CTCIF)
         break;
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         my_printf("CRCMDMA timeout cisr=%08lx bndt=%08lx\r\n",
                   (unsigned long)cisr, (unsigned long)ch->CBNDTR);
         ch->CCR = 0U;
         crc32_mdma_clear_flags(ch);
         crc32_mdma_active = false;
         return HAL_TIMEOUT;
      }
   }

   ch->CCR = 0U;
   crc32_mdma_clear_flags(ch);
   crc32_mdma_active = false;
   __asm volatile("dsb sy" ::: "memory");
   return HAL_OK;
}

static uint32_t crc32_hw_final(void)
{
   return CRC1->DR ^ CRC32_XOROUT;
}

static bool crc32_hw_begin(void)
{
   static const uint8_t test[9] = {
      '1', '2', '3', '4', '5', '6', '7', '8', '9'
   };

   crc32_hw_enable();
   if (!crc32_hw_checked) {
      volatile uint8_t *const p = (volatile uint8_t *)DEF_DDR_BASE;
      for (uint32_t i = 0U; i < sizeof(test); i++)
         p[i] = test[i];
      for (uint32_t a = DEF_DDR_BASE & ~31UL;
           a < DEF_DDR_BASE + sizeof(test); a += 32U)
         L1C_CleanInvalidateDCacheMVA((void *)a);
      __asm volatile("dsb sy" ::: "memory");

      crc32_hw_reset();
      HAL_StatusTypeDef s = crc32_mdma_start(p, sizeof(test));
      if (s == HAL_OK)
         s = crc32_mdma_wait(1000U);
      crc32_hw_available =
         (s == HAL_OK) && (crc32_hw_final() == 0xCBF43926UL);
      crc32_hw_checked = true;
   }
   if (!crc32_hw_available)
      return false;

   crc32_hw_reset();
   return true;
}

static bool crc32_hw_begin_direct(void)
{
   static const uint8_t test[9] = {
      '1', '2', '3', '4', '5', '6', '7', '8', '9'
   };

   crc32_hw_enable();
   if (!crc32_hw_direct_checked) {
      volatile uint8_t *const dr8 = (volatile uint8_t *)&CRC1->DR;
      crc32_hw_reset();
      for (uint32_t i = 0U; i < sizeof(test); i++)
         *dr8 = test[i];
      crc32_hw_direct_available =
         (crc32_hw_final() == 0xCBF43926UL);
      crc32_hw_direct_checked = true;
   }
   if (!crc32_hw_direct_available)
      return false;

   crc32_hw_reset();
   return true;
}

static uint32_t crc32_matrix_times(const uint32_t *mat, uint32_t vec)
{
   uint32_t sum = 0U;
   while (vec) {
      if (vec & 1U)
         sum ^= *mat;
      vec >>= 1;
      mat++;
   }
   return sum;
}

static void crc32_matrix_square(uint32_t *square, const uint32_t *mat)
{
   for (uint32_t i = 0U; i < 32U; i++)
      square[i] = crc32_matrix_times(mat, mat[i]);
}

static uint32_t crc32_combine(uint32_t crc1, uint32_t crc2, uint32_t len2)
{
   uint32_t even[32];
   uint32_t odd[32];

   if (len2 == 0U)
      return crc1;

   odd[0] = CRC32_POLY;
   uint32_t row = 1U;
   for (uint32_t i = 1U; i < 32U; i++) {
      odd[i] = row;
      row <<= 1;
   }
   crc32_matrix_square(even, odd);
   crc32_matrix_square(odd, even);

   do {
      crc32_matrix_square(even, odd);
      if (len2 & 1U)
         crc1 = crc32_matrix_times(even, crc1);
      len2 >>= 1;
      if (len2 == 0U)
         break;

      crc32_matrix_square(odd, even);
      if (len2 & 1U)
         crc1 = crc32_matrix_times(odd, crc1);
      len2 >>= 1;
   } while (len2 != 0U);

   return crc1 ^ crc2;
}

static void crc32_pattern_init(void)
{
   if (crc32_pattern_ready)
      return;
   crc32_table_init();
   uint32_t crc = CRC32_INIT;
   crc32_pattern_prefix[0] = 0U;
   for (uint32_t i = 0U; i < sizeof(crc32_pattern); i++) {
      crc32_pattern[i] = (uint8_t)i;
      crc = crc32_update_byte(crc, crc32_pattern[i]);
      crc32_pattern_prefix[i + 1U] = crc ^ CRC32_XOROUT;
   }
   crc32_pattern_ready = true;
}

static uint32_t crc32_expected(uint32_t len)
{
   crc32_pattern_init();

   uint32_t reps = len >> 8;
   const uint32_t rem = len & 0xFFU;
   uint32_t result_crc = 0U;
   uint32_t block_crc = crc32_pattern_prefix[256];
   uint32_t block_len = 256U;

   while (reps) {
      if (reps & 1U)
         result_crc = crc32_combine(result_crc, block_crc, block_len);
      reps >>= 1;
      if (reps) {
         block_crc = crc32_combine(block_crc, block_crc, block_len);
         block_len <<= 1;
      }
   }
   if (rem)
      result_crc = crc32_combine(result_crc, crc32_pattern_prefix[rem], rem);
   return result_crc;
}

/* CRC32 of `len` copies of constant byte 0xAA. Same poly/init/finalxor
 * as crc32_expected. Used by quad MISSION path where the FPGA slave
 * emits constant 0xAA on all four lanes for alignment-independent
 * channel integrity validation.
 */
static uint32_t crc32_aa(uint32_t len)
{
   crc32_table_init();

   /* CRC of 256 0xAA bytes (raw, no XOROUT) for combine seed. */
   uint32_t block_crc_raw = CRC32_INIT;
   for (uint32_t i = 0U; i < 256U; i++)
      block_crc_raw = crc32_update_byte(block_crc_raw, 0xAAU);
   const uint32_t block_crc = block_crc_raw ^ CRC32_XOROUT;
   const uint32_t block_len = 256U;

   uint32_t reps = len >> 8;
   const uint32_t rem = len & 0xFFU;
   uint32_t result_crc = 0U;
   uint32_t cur_crc = block_crc;
   uint32_t cur_len = block_len;

