js216/stm32mp135_test_board/baremetal/qspi/src/cli.c
static void cmd_mm(int argc, char **argv)
{
   uint32_t addr = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   uint32_t len  = arg_u32(argc > 1 ? argv[1] : NULL, 16U);
   if (len > READ_CAP) len = READ_CAP;
   const qspi_cmd_t c = {
      .instruction   = 0xEBU,
      .addr_bytes    = 3U,
      .alt_bytes     = 0xA0U, .alt_bytes_len = 1U,
      .dummy_cycles  = 4U,
      .inst_lines    = QSPI_LINES_1,
      .addr_lines    = QSPI_LINES_4,
      .alt_lines     = QSPI_LINES_4,
      .data_lines    = QSPI_LINES_4,
   };
   if (qspi_mm_enable(&c) != HAL_OK) {
      my_printf("ERR mm\r\n");
      return;
   }
   const volatile uint8_t *src =
       (const volatile uint8_t *)(QSPI_MM_BASE + addr);
   for (uint32_t i = 0; i < len; i++)
      io_buf[i] = src[i];
   qspi_mm_disable();
   my_printf("MM read %lu @ 0x%08lx\r\n",
             (unsigned long)len, (unsigned long)addr);
   hexdump(addr, io_buf, len);
}

/* Memory-mapped quad-read benchmark.  Programs FMODE=11 with the
 * 0x6B Quad Output Read recipe (3-byte addr, 9 dummy cycles, quad
 * data lines) so the QUADSPI peripheral autonomously refills its
 * prefetch buffer; the CPU (or MDMA) then copies LEN bytes from the
 * QSPI memory-mapped window straight into DDR (DEF_DDR_BASE, no
 * io_buf staging) and reports wall-rate.  This path bypasses MDMA's
 * per-word AXI handshake (the indirect-read bottleneck identified in
 * agent4/TODO.md) so it should comfortably exceed the 337 Mbps
 * indirect-read ceiling.
 *
 * argv[0] = LEN (default 1 MiB, capped at 16 MiB).
 * argv[1] = VARIANT (default 0):
 *   0: byte-by-byte CPU loop  (regression baseline, ~36 Mbps)
 *   1: 32-bit word CPU loop
 *   2: memcpy() with non-volatile aliases (LDM/STM bursts)
 *   3: MDMA mem-to-mem from QSPI_MM_BASE (software-request)
 */
static uint32_t mmap_bench_mdma(uint32_t len, uint32_t *cisr_out,
                                uint32_t *cesr_out)
{
   *cisr_out = 0U;
   *cesr_out = 0U;
   if (len == 0U)
      return 0U;
   /* Block-repeat path requires 64 KiB-multiple lengths for >0x1FFFF. */
   if (len > 0x1FFFFU && (len & 0xFFFFU)) {
      my_printf("ERR mmap mdma: len must be 64 KiB-multiple if >128 KB\r\n");
      return 0U;
   }

   __HAL_RCC_MDMA_CLK_ENABLE();

   MDMA_Channel_TypeDef *const ch = MDMA_Channel0;
   ch->CCR = 0U;
   ch->CIFCR = MDMA_CIFCR_CTEIF | MDMA_CIFCR_CCTCIF | MDMA_CIFCR_CBRTIF |
               MDMA_CIFCR_CBTIF | MDMA_CIFCR_CLTCIF;

   /* Clean+invalidate destination cache range so:
    *  (a) any dirty CPU-side cache lines won't get written back over
    *      MDMA-deposited data, and
    *  (b) subsequent CPU reads see fresh DDR contents. */
   const uint32_t dst_addr = DEF_DDR_BASE;
   const uint32_t line_sz = 32U;
   for (uint32_t a = dst_addr & ~(line_sz - 1U);
        a < dst_addr + len; a += line_sz)
      L1C_CleanInvalidateDCacheMVA((void *)a);
   __asm volatile("dsb sy" ::: "memory");

   /* CTCR for mem-to-mem from QSPI_MM_BASE:
    *   SINC=2 (source increments), DINC=2 (dest increments)
    *   SSIZE=2 (32-bit reads), DSIZE=2 (32-bit writes)
    *   SINCOS=2, DINCOS=2 (advance by 32-bit words)
    *   SBURST=4 (16-beat read burst), DBURST=4 (16-beat write burst)
    *   TLEN=64-1 (64 B per buffer transfer, == 16 beats of 32 b)
    *   TRGM picks per-request granularity (see below) so a single
    *      software trigger drains the whole block / repeated block
    *      rather than only one 64 B buffer.
    *   SWRM=1 (software request mode)
    *   BWM=1 (bufferable writes -- DDR is normal cacheable)
    */
   const uint32_t tlen = 64U;
   uint32_t trgm;
   if (len <= 64U)
      trgm = 0U; /* one buffer per request */
   else if (len <= 65536U)
      trgm = 1U; /* one block (BNDT bytes) per request */
   else
      trgm = 2U; /* one repeated block per request -- drains entire xfer */
   ch->CTCR =
      (2U << MDMA_CTCR_SINC_Pos)   |
      (2U << MDMA_CTCR_DINC_Pos)   |
      (2U << MDMA_CTCR_SSIZE_Pos)  |
      (2U << MDMA_CTCR_DSIZE_Pos)  |
      (2U << MDMA_CTCR_SINCOS_Pos) |
      (2U << MDMA_CTCR_DINCOS_Pos) |
      (4U << MDMA_CTCR_SBURST_Pos) |
      (4U << MDMA_CTCR_DBURST_Pos) |
      ((tlen - 1U) << MDMA_CTCR_TLEN_Pos) |
      (trgm << MDMA_CTCR_TRGM_Pos) |
      MDMA_CTCR_SWRM |
      MDMA_CTCR_BWM;

   if (len > 0x1FFFFU) {
      const uint32_t blocks = len >> 16; /* len / 65536 */
      /* BRSUM/BRDUM = 1 means the block-start address INCREMENTS
       * across blocks (continues forward); BRSUM/BRDUM = 0 would
       * leave the start fixed (not what we want for contiguous src
       * and contiguous dst). */
      ch->CBNDTR = (65536U & MDMA_CBNDTR_BNDT_Msk) |
                   ((blocks - 1U) << MDMA_CBNDTR_BRC_Pos) |
                   MDMA_CBNDTR_BRDUM | MDMA_CBNDTR_BRSUM;
   } else {
      ch->CBNDTR = len & MDMA_CBNDTR_BNDT_Msk;
   }
   ch->CBRUR = 0U;
   ch->CSAR  = QSPI_MM_BASE + 0U;
   ch->CDAR  = dst_addr;
   ch->CTBR  = 0U;
   ch->CMAR  = 0U;
   ch->CMDR  = 0U;

   __asm volatile("dsb sy" ::: "memory");
   ch->CCR = MDMA_CCR_EN;
   __asm volatile("dsb sy" ::: "memory");
   const uint32_t t0 = HAL_GetTick();
   /* Kick: software request fires the first buffer; SWRM mode keeps
    * re-arming until BNDT/BRC drain. */
   ch->CCR = MDMA_CCR_EN | MDMA_CCR_SWRQ;

   const uint32_t deadline = t0 + 60000U;
   uint32_t cisr;
   for (;;) {
      cisr = ch->CISR;
      if (cisr & MDMA_CISR_TEIF)
         break;
      if (cisr & MDMA_CISR_CTCIF)
         break;
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         my_printf("ERR mmap mdma: timeout cisr=%08lx bndt=%08lx\r\n",
                   (unsigned long)cisr, (unsigned long)ch->CBNDTR);
         break;
      }
   }
   const uint32_t dt = HAL_GetTick() - t0;
   *cisr_out = cisr;
   *cesr_out = ch->CESR;
   ch->CCR = 0U;
   ch->CIFCR = MDMA_CIFCR_CTEIF | MDMA_CIFCR_CCTCIF | MDMA_CIFCR_CBRTIF |
               MDMA_CIFCR_CBTIF | MDMA_CIFCR_CLTCIF;
   __asm volatile("dsb sy" ::: "memory");
   return dt;
}

static void cmd_mmap_bench(int argc, char **argv)
{
   uint32_t len = arg_u32(argc > 0 ? argv[0] : NULL, 1048576U);
   if (len == 0U) len = 1048576U;
   if (len > 16U * 1024U * 1024U) len = 16U * 1024U * 1024U;
   uint32_t variant = arg_u32(argc > 1 ? argv[1] : NULL, 0U);
   if (variant > 3U) variant = 0U;

   /* Variants 1/2/3 require 4-byte alignment of len. */
   if (variant != 0U && (len & 0x3U)) {
      my_printf("ERR mmap: variant=%lu requires 4-byte aligned len\r\n",
                (unsigned long)variant);
      return;
   }

   const qspi_cmd_t c = {
      .instruction   = 0x6BU,
      .addr_bytes    = 3U,
      .alt_bytes     = 0U, .alt_bytes_len = 0U,
      .dummy_cycles  = 9U,
      .inst_lines    = QSPI_LINES_1,
      .addr_lines    = QSPI_LINES_1,
      .alt_lines     = QSPI_LINES_1,
      .data_lines    = QSPI_LINES_4,
   };
   if (qspi_mm_enable(&c) != HAL_OK) {
      my_printf("ERR mmap\r\n");
      return;
   }

   uint32_t dt = 0U;
   uint32_t mdma_cisr = 0U;
   uint32_t mdma_cesr = 0U;

