js216/stm32mp135_test_board/baremetal/qspi/src/cli.c
   switch (variant) {
      case 0U: {
         volatile uint8_t *src = (volatile uint8_t *)(QSPI_MM_BASE + 0U);
         volatile uint8_t *dst = (volatile uint8_t *)DEF_DDR_BASE;
         uint32_t t0 = HAL_GetTick();
         for (uint32_t i = 0; i < len; i++)
            dst[i] = src[i];
         dt = HAL_GetTick() - t0;
         break;
      }
      case 1U: {
         volatile uint32_t *src = (volatile uint32_t *)(QSPI_MM_BASE + 0U);
         volatile uint32_t *dst = (volatile uint32_t *)DEF_DDR_BASE;
         const uint32_t nw = len >> 2;
         uint32_t t0 = HAL_GetTick();
         for (uint32_t i = 0; i < nw; i++)
            dst[i] = src[i];
         dt = HAL_GetTick() - t0;
         break;
      }
      case 2U: {
         /* Non-volatile aliases so gcc emits LDM/STM bursts.  The QSPI
          * MM region is mapped non-cacheable so reads still go to the
          * peripheral; gcc just treats them as ordinary memory and is
          * free to coalesce. */
         void *src = (void *)(QSPI_MM_BASE + 0U);
         void *dst = (void *)DEF_DDR_BASE;
         uint32_t t0 = HAL_GetTick();
         memcpy(dst, src, len);
         dt = HAL_GetTick() - t0;
         break;
      }
      case 3U:
      default: {
         dt = mmap_bench_mdma(len, &mdma_cisr, &mdma_cesr);
         break;
      }
   }

   qspi_mm_disable();

   uint32_t mbps_x100 = (dt == 0U)
       ? 0U
       : (uint32_t)(((uint64_t)len * 8ULL * 100ULL) /
                    ((uint64_t)dt * 1000ULL));
   if (variant == 3U) {
      my_printf("mmap %lu B quad in %lu ms, %lu.%02lu Mbps, "
                "presc=%lu, qspi_hz=%lu, variant=%lu, "
                "cisr=%08lx, cesr=%08lx\r\n",
                (unsigned long)len, (unsigned long)dt,
                (unsigned long)(mbps_x100 / 100U),
                (unsigned long)(mbps_x100 % 100U),
                (unsigned long)qspi_get_prescaler(),
                (unsigned long)qspi_kernel_hz(),
                (unsigned long)variant,
                (unsigned long)mdma_cisr,
                (unsigned long)mdma_cesr);
   } else {
      my_printf("mmap %lu B quad in %lu ms, %lu.%02lu Mbps, "
                "presc=%lu, qspi_hz=%lu, variant=%lu\r\n",
                (unsigned long)len, (unsigned long)dt,
                (unsigned long)(mbps_x100 / 100U),
                (unsigned long)(mbps_x100 % 100U),
                (unsigned long)qspi_get_prescaler(),
                (unsigned long)qspi_kernel_hz(),
                (unsigned long)variant);
   }
}

static void cmd_bench(int argc, char **argv)
{
   uint32_t len  = arg_u32(argc > 0 ? argv[0] : NULL, 256U);
   uint32_t quad = arg_u32(argc > 1 ? argv[1] : NULL, 0U);
   uint32_t raw  = arg_u32(argc > 2 ? argv[2] : NULL, 0U);
   if (len == 0U) len = 256U;
   busy_flag = true;

   const uint8_t  opcode = quad ? 0x6BU : 0x0BU;
   const qspi_lines_t dl = quad ? QSPI_LINES_4 : QSPI_LINES_1;
   const uint8_t dummy   = raw ? 0U : (quad ? 9U : 8U);

   uint32_t crc = 0, firsterr = 0, dt = 0;
   uint8_t  got16[16] = {0};
   my_printf("BENCHDBG cmd_pre t=%lu len=%lu quad=%lu opcode=%02x "
             "presc=%lu\r\n",
             (unsigned long)HAL_GetTick(), (unsigned long)len,
             (unsigned long)quad, (unsigned)opcode,
             (unsigned long)qspi_get_prescaler());
   HAL_StatusTypeDef s = qspi_bench_read(opcode, dl, dummy, len,
                                         raw != 0U,
                                         &crc, &firsterr, got16, &dt);
   my_printf("BENCHDBG cmd_post t=%lu rc=%d dt=%lu firsterr=%ld\r\n",
             (unsigned long)HAL_GetTick(), (int)s, (unsigned long)dt,
             (firsterr == 0xFFFFFFFFU) ? -1L : (long)firsterr);
   if (s != HAL_OK) {
      my_printf("ERR bench (%d)\r\n", (int)s);
      busy_flag = false;
      return;
   }
   if (dt == 0U) dt = 1U;
   /* Mbps in tenths: rate (Mbits/s * 10) = len * 8 * 10 / (dt * 1000)
    *               = len / (dt * 12.5)   ~=  len * 80 / (dt * 1000).
    * Guard the multiplication against 32-bit overflow for len up to 50 MB. */
   uint32_t mbps_x10;
   if (len <= 50000000U)
      mbps_x10 = (len * 80U) / (dt * 1000U);
   else
      mbps_x10 = ((len / 1000U) * 80U) / dt;
   const long firsterr_signed =
       (firsterr == 0xFFFFFFFFU) ? -1L : (long)firsterr;
   my_printf("bench %lu B %s @ presc=%lu in %lu ms, %lu.%lu Mbps, "
             "crc32=%08lx, expect=%08lx, firsterr=%ld, "
             "got=%02x %02x %02x %02x "
             "%02x %02x %02x %02x %02x %02x %02x %02x "
             "%02x %02x %02x %02x\r\n",
             (unsigned long)len,
             quad ? "quad" : "1lane",
             (unsigned long)qspi_get_prescaler(),
             (unsigned long)dt,
             (unsigned long)(mbps_x10 / 10U),
             (unsigned long)(mbps_x10 % 10U),
             (unsigned long)crc,
             (unsigned long)crc32_expected(len),
             firsterr_signed,
             got16[0], got16[1], got16[2], got16[3],
             got16[4], got16[5], got16[6], got16[7],
             got16[8], got16[9], got16[10], got16[11],
             got16[12], got16[13], got16[14], got16[15]);
   busy_flag = false;
}

/* MDMA streaming read into DDR.  Validates the same i&0xFF incrementing
 * pattern the bench expects and prints throughput + CRC32 + first-error
 * offset.  Destination is `DEF_DDR_BASE` (0xC0000000) -- 16 MB+ workloads
 * are expected to exceed SRAM and must use this path. */
static void cmd_mdma(int argc, char **argv)
{
   uint32_t len  = arg_u32(argc > 0 ? argv[0] : NULL, 4096U);
   uint32_t quad = arg_u32(argc > 1 ? argv[1] : NULL, 0U);
   uint32_t raw  = arg_u32(argc > 2 ? argv[2] : NULL, 0U);
   if (len == 0U) len = 4096U;
   /* MDMA path requires 4-byte alignment. Large decimal transfers are
    * split into 64 KB-multiple chunks plus a final aligned tail. */
   if (len & 0x3U) {
      my_printf("ERR mdma: len must be 4-byte aligned\r\n");
      return;
   }
   busy_flag = true;

   const uint8_t  opcode = quad ? 0x6BU : 0x0BU;
   const qspi_lines_t dl = quad ? QSPI_LINES_4 : QSPI_LINES_1;
   const uint8_t dummy   = raw ? 0U : (quad ? 9U : 8U);
   const uint32_t dst    = DEF_DDR_BASE;
   volatile uint8_t *const p = (volatile uint8_t *)dst;
   const uint32_t poison_ms = 0U;

