js216/stm32mp135_test_board/baremetal/qspi/src/cli.c
   my_printf("mdma_begin %lu B %s\r\n",
             (unsigned long)len,
             quad ? "quad" : "1lane");
   const uint32_t t0 = HAL_GetTick();
   uint32_t done = 0U;
   HAL_StatusTypeDef s = HAL_OK;
   while (done < len) {
      uint32_t n = mdma_segment_len(len - done, 1048576U);
      s = qspi_mdma_read(opcode, dl, dummy, n, raw != 0U, dst + done,
                         60000U, true);
      if (s != HAL_OK)
         break;
      done += n;
   }
   const uint32_t xfer_ms = HAL_GetTick() - t0;
   if (s != HAL_OK) {
      my_printf("ERR mdma (%d) done=%lu dt=%lu\r\n",
                (int)s, (unsigned long)done, (unsigned long)xfer_ms);
      busy_flag = false;
      return;
   }
   uint32_t xfer_dt = xfer_ms;
   if (xfer_dt == 0U) xfer_dt = 1U;
   uint32_t xfer_mbps_x10;
   if (len <= 50000000U)
      xfer_mbps_x10 = (len * 80U) / (xfer_dt * 1000U);
   else
      xfer_mbps_x10 = ((len / 1000U) * 80U) / xfer_dt;
   my_printf("mdma_xfer %lu B %s in %lu ms, %lu.%lu Mbps\r\n",
             (unsigned long)len,
             quad ? "quad" : "1lane",
             (unsigned long)xfer_ms,
             (unsigned long)(xfer_mbps_x10 / 10U),
             (unsigned long)(xfer_mbps_x10 % 10U));

   /* CRC32 + first-error scan over the DDR buffer. */
   const uint32_t validate_t0 = HAL_GetTick();
   uint32_t crc       = 0xFFFFFFFFUL;
   uint32_t first_err = 0xFFFFFFFFUL;
   for (uint32_t i = 0; i < len; i++) {
      const uint8_t b = p[i];
      crc ^= (uint32_t)b;
      for (int j = 0; j < 8; j++)
         crc = (crc >> 1) ^ (0xEDB88320UL & (-(int32_t)(crc & 1U)));
      const uint8_t exp = (uint8_t)(i & 0xFFU);
      if (b != exp && first_err == 0xFFFFFFFFUL)
         first_err = i;
   }
   crc ^= 0xFFFFFFFFUL;
   const uint32_t validate_ms = HAL_GetTick() - validate_t0;

   uint32_t dt = xfer_ms;
   if (dt == 0U) dt = 1U;
   uint32_t mbps_x10;
   if (len <= 50000000U)
      mbps_x10 = (len * 80U) / (dt * 1000U);
   else
      mbps_x10 = ((len / 1000U) * 80U) / dt;

   const long firsterr_signed =
       (first_err == 0xFFFFFFFFU) ? -1L : (long)first_err;
   if (firsterr_signed >= 0L && (uint32_t)firsterr_signed < len) {
      uint32_t lo = (firsterr_signed >= 8L)
                      ? (uint32_t)(firsterr_signed - 8L) : 0U;
      uint32_t hi = (uint32_t)firsterr_signed + 24U;
      if (hi > len) hi = len;
      my_printf("firsterr_dump @%lu:", (unsigned long)lo);
      for (uint32_t k = lo; k < hi; k++)
         my_printf(" %02x", (unsigned)p[k]);
      my_printf("\r\n");
   }
   my_printf("mdma %lu B %s in %lu ms, %lu.%lu Mbps, "
             "crc32=%08lx, expect=%08lx, firsterr=%ld, "
             "xfer=%lu ms, validate=%lu ms, "
             "poison=%lu ms, auto=%s\r\n",
             (unsigned long)len,
             quad ? "quad" : "1lane",
             (unsigned long)dt,
             (unsigned long)(mbps_x10 / 10U),
             (unsigned long)(mbps_x10 % 10U),
             (unsigned long)crc,
             (unsigned long)crc32_expected(len),
             firsterr_signed,
             (unsigned long)xfer_ms,
             (unsigned long)validate_ms,
             (unsigned long)poison_ms,
             auto_consume ? "on" : "off");
   busy_flag = false;
}

/* Twin MDMA-into-DDR quad raw read for varying-data integrity check.
 * Reads LEN bytes twice via qspi_mdma_read into two separate DDR
 * buffers (slot 0 at DEF_DDR_BASE, slot 1 at DEF_DDR_BASE + LEN_PAD)
 * with the same opcode/lines/dummy/raw settings, then byte-compares
 * the two buffers and reports `firsterr=-1` when every byte matches.
 * The slave (spi_quad.bin from spi.nw with LANES=4) emits a
 * byte-incrementing stream; if the channel transports the same
 * varying byte pattern identically twice, the two DDR buffers are
 * bit-equal, which is real-data integrity validation that does not
 * depend on the master's first-sample alignment relative to the
 * slave's output presenter. Quad raw only (the canonical mission
 * configuration). */
static void cmd_twin_mdma(int argc, char **argv)
{
   uint32_t len = arg_u32(argc > 0 ? argv[0] : NULL, 16777216U);
   if (len == 0U) len = 16777216U;
   if (len & 0x3U) {
      my_printf("ERR twin: len must be 4-byte aligned\r\n");
      return;
   }
   /* Cap at 16 MiB per slot to keep within DDR test region. */
   if (len > 16777216U) {
      my_printf("ERR twin: len capped at 16777216\r\n");
      return;
   }
   busy_flag = true;

   const uint8_t opcode = 0x6BU;        /* not used in raw mode */
   const qspi_lines_t dl = QSPI_LINES_4;
   const uint8_t dummy = 0U;            /* raw mode: no opcode/dummy */
   const bool raw = true;

   const uint32_t slot0 = DEF_DDR_BASE;
   const uint32_t slot1 = DEF_DDR_BASE + 16777216U;
   volatile uint8_t *const p0 = (volatile uint8_t *)slot0;
   volatile uint8_t *const p1 = (volatile uint8_t *)slot1;

   my_printf("twin_begin %lu B quad raw\r\n", (unsigned long)len);

   const uint32_t t0 = HAL_GetTick();
   HAL_StatusTypeDef s = qspi_mdma_read(opcode, dl, dummy, len, raw,
                                        slot0, 60000U, true);
   if (s != HAL_OK) {
      my_printf("ERR twin pass1 (%d)\r\n", (int)s);
      busy_flag = false;
      return;
   }
   const uint32_t t1 = HAL_GetTick();
   my_printf("twin_pass1_done %lu ms\r\n",
             (unsigned long)(t1 - t0));

   s = qspi_mdma_read(opcode, dl, dummy, len, raw,
                      slot1, 60000U, true);
   if (s != HAL_OK) {
      my_printf("ERR twin pass2 (%d)\r\n", (int)s);
      busy_flag = false;
      return;
   }
   const uint32_t t2 = HAL_GetTick();

   /* Byte-compare and CRC the slot0 buffer. */
   uint32_t first_err = 0xFFFFFFFFUL;
   uint32_t crc       = 0xFFFFFFFFUL;
   for (uint32_t i = 0; i < len; i++) {
      const uint8_t b0 = p0[i];
      const uint8_t b1 = p1[i];
      crc ^= (uint32_t)b0;
      for (int j = 0; j < 8; j++)
         crc = (crc >> 1) ^ (0xEDB88320UL & (-(int32_t)(crc & 1U)));
      if (b0 != b1 && first_err == 0xFFFFFFFFUL)
         first_err = i;
   }
   crc ^= 0xFFFFFFFFUL;
   const uint32_t validate_ms = HAL_GetTick() - t2;

   const long firsterr_signed =
       (first_err == 0xFFFFFFFFU) ? -1L : (long)first_err;

   /* Hex dump first 16 bytes of each buffer + first mismatch context. */
   my_printf("twin_hex0[0..15]:");
   for (uint32_t k = 0; k < 16U && k < len; k++)
      my_printf(" %02x", (unsigned)p0[k]);
   my_printf("\r\n");
   my_printf("twin_hex1[0..15]:");
   for (uint32_t k = 0; k < 16U && k < len; k++)
      my_printf(" %02x", (unsigned)p1[k]);
   my_printf("\r\n");
   if (firsterr_signed >= 0L && (uint32_t)firsterr_signed < len) {
      uint32_t lo = (firsterr_signed >= 8L)
                      ? (uint32_t)(firsterr_signed - 8L) : 0U;
      uint32_t hi = (uint32_t)firsterr_signed + 24U;
      if (hi > len) hi = len;
      my_printf("twin_diff @%lu p0:", (unsigned long)lo);
      for (uint32_t k = lo; k < hi; k++)
         my_printf(" %02x", (unsigned)p0[k]);
      my_printf("\r\n");
      my_printf("twin_diff @%lu p1:", (unsigned long)lo);
      for (uint32_t k = lo; k < hi; k++)
         my_printf(" %02x", (unsigned)p1[k]);
      my_printf("\r\n");
   }

