js216/stm32mp135_test_board/baremetal/qspi/src/cli.c
static void gpio_prepare_bitbang(void)
{
   QUADSPI->CR &= ~QUADSPI_CR_EN;
   config_gpio_bitbang_output(0); /* CLK */
   config_gpio_bitbang_output(1); /* NCS */
   for (int i = 2; i < 6; i++)
      config_gpio_pin(i, GPIO_MODE_INPUT);
   gpio_write_idx(0, 0U);
   gpio_write_idx(1, 1U);
   gpio_bitbang_delay();
}

static uint32_t gpio_clock_sample_nibble(void)
{
   gpio_write_idx(0, 0U);
   gpio_bitbang_delay();
   gpio_write_idx(0, 1U);
   gpio_bitbang_delay();
   return gpio_read_idx(2) | (gpio_read_idx(3) << 1) |
          (gpio_read_idx(4) << 2) | (gpio_read_idx(5) << 3);
}

static void gpio_k_clock(void)
{
   gpio_write_idx(0, 0U);
   gpio_k_settle_delay();
   gpio_write_idx(0, 1U);
   gpio_k_settle_delay();
}

static uint32_t gpio_k_clock_sample_nibble(void)
{
   gpio_write_idx(0, 0U);
   gpio_k_settle_delay();
   const uint32_t a = gpio_read_nibble_raw();
   gpio_k_settle_delay();
   const uint32_t b = gpio_read_nibble_raw();
   gpio_k_settle_delay();
   const uint32_t c = gpio_read_nibble_raw();
   gpio_write_idx(0, 1U);
   gpio_k_settle_delay();
   return (a & b) | (a & c) | (b & c);
}

static void gpio_clock_out_io0(uint32_t bit)
{
   gpio_write_idx(0, 0U);
   gpio_write_idx(2, bit);
   gpio_bitbang_delay();
   gpio_write_idx(0, 1U);
   gpio_bitbang_delay();
}

static void gpio_send_io0_byte(uint8_t v)
{
   for (int bit = 7; bit >= 0; bit--)
      gpio_clock_out_io0((v >> bit) & 1U);
}

static void cmd_gpio(int argc, char **argv)
{
   uint32_t mask = arg_u32(argc > 0 ? argv[0] : NULL, 0U);
   /* Disabling QUADSPI breaks the auto-JEDEC loop; suspend it. */
   busy_flag = true;
   force_gpio_outputs();
   for (int i = 0; i < 6; i++) {
      GPIO_PinState s = (mask >> i) & 1U ? GPIO_PIN_SET : GPIO_PIN_RESET;
      HAL_GPIO_WritePin(pins[i].port, pins[i].pin, s);
   }
   my_printf("gpio mask=0x%02lx:", (unsigned long)mask);
   for (int i = 0; i < 6; i++) {
      int rb = HAL_GPIO_ReadPin(pins[i].port, pins[i].pin) == GPIO_PIN_SET;
      my_printf(" %s=%d", pins[i].name, rb);
   }
   my_printf("\r\n");
}

static void cmd_gpio_read(void)
{
   busy_flag = true;
   force_gpio_inputs();
   my_printf("gpio read:");
   for (int i = 0; i < 6; i++) {
      int rb = HAL_GPIO_ReadPin(pins[i].port, pins[i].pin) == GPIO_PIN_SET;
      my_printf(" %s=%d", pins[i].name, rb);
   }
   my_printf("\r\n");
}

static void cmd_gpio_bitbang_read(int argc, char **argv)
{
   uint32_t len  = arg_u32(argc > 0 ? argv[0] : NULL, 16U);
   uint32_t quad = arg_u32(argc > 1 ? argv[1] : NULL, 0U);
   uint32_t io   = arg_u32(argc > 2 ? argv[2] : NULL, 1U);
   if (len > READ_CAP)
      len = READ_CAP;
   if (io > 3U) {
      my_printf("ERR io range\r\n");
      return;
   }

   busy_flag = true;
   gpio_prepare_bitbang();
   gpio_write_idx(1, 0U);
   gpio_bitbang_delay();

   for (uint32_t n = 0; n < len; n++) {
      uint8_t v = 0U;
      if (quad) {
         uint32_t hi = gpio_clock_sample_nibble();
         uint32_t lo = gpio_clock_sample_nibble();
         v = (uint8_t)((hi << 4) | lo);
      } else {
         int pin = 2 + (int)io;
         for (int bit = 7; bit >= 0; bit--) {
            gpio_write_idx(0, 0U);
            gpio_bitbang_delay();
            gpio_write_idx(0, 1U);
            gpio_bitbang_delay();
            if (gpio_read_idx(pin))
               v |= (uint8_t)(1U << bit);
         }
      }
      io_buf[n] = v;
   }

   gpio_write_idx(0, 0U);
   gpio_write_idx(1, 1U);
   if (quad)
      my_printf("bb read %lu (quad)\r\n", (unsigned long)len);
   else
      my_printf("bb read %lu (1lane io=%lu)\r\n",
                (unsigned long)len, (unsigned long)io);
   hexdump(0U, io_buf, len);
}

static void cmd_gpio_6b_read(int argc, char **argv)
{
   uint32_t len = arg_u32(argc > 0 ? argv[0] : NULL, 16U);
   uint8_t nibbles[32];
   uint32_t nibble_count = 0U;
   if (len > READ_CAP)
      len = READ_CAP;

   busy_flag = true;
   gpio_prepare_bitbang();
   config_gpio_bitbang_output(2); /* IO0 command/address */
   gpio_write_idx(2, 0U);
   gpio_write_idx(1, 0U);
   gpio_bitbang_delay();

   gpio_send_io0_byte(0x6BU);
   gpio_send_io0_byte(0x00U);
   gpio_send_io0_byte(0x00U);
   gpio_send_io0_byte(0x00U);

   gpio_write_idx(0, 0U);
   for (int i = 2; i < 6; i++)
      config_gpio_pin(i, GPIO_MODE_INPUT);

   for (uint32_t i = 0; i < 8U; i++)
      gpio_k_clock();

   for (uint32_t n = 0; n < len; n++) {
      uint32_t lo = gpio_k_clock_sample_nibble();
      uint32_t hi = gpio_k_clock_sample_nibble();
      if (nibble_count < (uint32_t)sizeof(nibbles))
         nibbles[nibble_count++] = (uint8_t)lo;
      if (nibble_count < (uint32_t)sizeof(nibbles))
         nibbles[nibble_count++] = (uint8_t)hi;
      io_buf[n] = (uint8_t)((hi << 4) | lo);
   }

   gpio_write_idx(0, 0U);
   gpio_write_idx(1, 1U);
   my_printf("bb 6b read %lu @ 0x00000000\r\n", (unsigned long)len);
   hexdump(0U, io_buf, len);
   my_printf("bb 6b nibbles:");
   for (uint32_t i = 0; i < nibble_count; i++)
      my_printf(" %x", nibbles[i] & 0xfU);
   my_printf("\r\n");
}

static void cmd_toggle(int argc, char **argv)
{
   uint32_t per = arg_u32(argc > 0 ? argv[0] : NULL, 1U);
   force_gpio_outputs();
   my_printf("toggle period=%lu ms (reset to stop)\r\n",
             (unsigned long)per);
   busy_flag = true;
   uint32_t lvl = 0;
   while (1) {
      for (int i = 0; i < 6; i++)
         HAL_GPIO_WritePin(pins[i].port, pins[i].pin,
                           lvl ? GPIO_PIN_SET : GPIO_PIN_RESET);
      lvl ^= 1U;
      HAL_Delay(per);
   }
}

static void cmd_abort(void)
{
   qspi_abort();
   /* drain RX FIFO of any leftover data from a botched read */
   while (QUADSPI->SR & QUADSPI_SR_FTF)
      (void)QUADSPI->DR;
   my_printf("abort\r\n");
}

/* -------- dispatch ------------------------------------------------ */

static void dispatch(char *line)
{
   while (*line == ' ' || *line == '\t')
      line++;
   if (!*line)
      return;
   char op = *line++;
   while (*line == ' ' || *line == '\t')
      line++;

   /* chip-erase double-tap confirmation */
   if (op == 'C' && pend_confirm_C_until &&
       (int32_t)(HAL_GetTick() - pend_confirm_C_until) < 0) {
      pend_confirm_C_until = 0;
      cmd_chip_erase_do();
      return;
   }
   pend_confirm_C_until = 0;

